Catalogs/РолиИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>РолиИсполнителей</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходомоСоздатьДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВсемПредприятиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомандыУтвердительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомандыОтрицательно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомандыСЗамечаниями</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКомандыУтвердительно</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКомандыОтрицательно</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКомандыСЗамечаниями</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийУтвердительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОтрицательно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСЗамечаниями</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЖурналУтвердительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЖурналОтрицательно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЖурналСЗамечаниями</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РолиИсполнителей/Forms/ФормаЭлемента1/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Предприятия.Доступность = НЕ Объект.ДоступенВсемПредприятиям;
	
	ЦветКомандыУтвердительно = Объект.Ссылка.ЦветКомандыУтвердительно.Получить();
	ЦветКомандыОтрицательно = Объект.Ссылка.ЦветКомандыОтрицательно.Получить();
	ЦветКомандыСЗамечаниями = Объект.Ссылка.ЦветКомандыСЗамечаниями.Получить();
	
	//ЗаполнитьТипамиДокументов();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенВсемПриИзменении(Элемент)
	Элементы.Предприятия.Доступность = НЕ Объект.ДоступенВсемПредприятиям;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ЦветКомандыУтвердительно = ЦветКомандыУтвердительно;
	//Объект.ЦветКомандыОтрицательно = ЦветКомандыОтрицательно;
	//Объект.ЦветКомандыСЗамечаниями = ЦветКомандыСЗамечаниями;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветКомандыУтвердительно = Новый ХранилищеЗначения(ЦветКомандыУтвердительно);
	ТекущийОбъект.ЦветКомандыОтрицательно = Новый ХранилищеЗначения(ЦветКомандыОтрицательно);
	ТекущийОбъект.ЦветКомандыСЗамечаниями = Новый ХранилищеЗначения(ЦветКомандыСЗамечаниями);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипамиДокументов()
	Элементы.ВидДокумента.РежимВыбораИзСписка = Истина;	
	СтруктураДоков = БПСервер.СписокВидовСЗ(Неопределено, "Все документы");
	
	ИндексКоманды = 0;
	Для Каждого ВидОперации Из СтруктураДоков Цикл
		Если ТипЗнч(ВидОперации.Ссылка) = Тип("СправочникСсылка.Д_ВидыВнутреннихДокументов") И НЕ ВидОперации.ЭтоРодитель Тогда
			Элементы.ВидДокумента.СписокВыбора.Добавить(ВидОперации.Ссылка);					
		КонецЕсли;
	КонецЦикла;
	
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Реестр заявок на оплату", "Реестр заявок на оплату"); 
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на оплату", "Заявка на оплату");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора", "Заявка на согласование договора");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Внутренний документ", "Внутренний документ");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на отгрузку", "Заявка на отгрузку");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на кадровое движение", "Заявка на кадровое движение");
	Если Константы.сабИспользоватьПодсистемуБюджетирование.Получить() Тогда
		Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на корректировку текущего бюджета", "Заявка на корректировку текущего бюджета");
		Элементы.ВидДокумента.СписокВыбора.Добавить("Бюджет оперативный", "Бюджет оперативный");
		Элементы.ВидДокумента.СписокВыбора.Добавить("Бюджет", "Бюджет");
	КонецЕсли;
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на торговлю", "Заявка на торговлю");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Карта сделки", "Карта сделки");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора по проведению ТММ", "Заявка на согласование договора по проведению ТММ");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора по оплате РБ(Премии)", "Заявка на согласование договора по оплате РБ(Премии)");
	Элементы.ВидДокумента.СписокВыбора.Добавить("Согласование отпуска", "Согласование отпуска");
 	
 
 КонецПроцедуры
